{
    "projects": [
        {
            "id": "0",
            "title": "Bball Connection",
            "img": "./images/bballcon.png",
            "alt": "Bball Connection Wordpress Ecommerce Site.",
            "description": "This site is a custom Wordpress Ecommerce site where I utilized _underscores to help create a custom child theme."
        },
        {
            "id": "1",
            "title": "Easy Grocery",
            "img": "./images/easygrocery.png",
            "alt": "Ecommerce Grocery Store Site.",
            "description": "The idea with this site was to create a mock grocery store that would utilize PHP, JS, JQuery, XHR, HTML, CSS and MySQL to display data. The results give a fully functional dynamic site."
        },
        {
            "id": "2",
            "title": "Internet Of Things",
            "img": "./images/iot.png",
            "alt": "Internet of Things Project.",
            "description": "This was a fun exploratory project using a BBC Micro:bit. The object was to create an interactive web based advertisement for a vacation destination. The tech stack for this was HTML, CSS and Javascript."
        },
        {
            "id": "3",
            "title": "The Loopy Prospector",
            "img": "./images/prospector.png",
            "alt": "A Javacript Game.",
            "description": "Welcome to The Loopy Propector. This is a Javascript game done with current ES6 practices. Also, utilizing CSS and HTML. The object is to see how much gold you can get before the river runs dry!"
        },
        {
            "id": "4",
            "title": "Task Today",
            "img": "./images/task-today.png",
            "alt": "Vue.js Web Application.",
            "description": "For this project I decided to tackle a simple Task taker web application. To accomplish this I chose to use Vue.js. For styling and content I used CSS and HTML and created a custom background image. One feature of the project I added was json data to give the user and inspirational qoute when using the web app."
        },
        {
            "id": "5",
            "title": "Mad Movies",
            "img": "./images/mad-movies.png",
            "alt": "Movie Information Database website.",
            "description": "The idea with this site was to create a functional movie database for users find information on their favorite movies. I used HTML, CSS, Javascript, JSON, XHR, and PHP coupled with MySQL to create a dynamic website. I also used Foundations CSS and sammy.js to help with the UI/UX of the site."
        }
    ]
}